---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.MultiplanarOption.IncludeOnlyPlanarCurves
enum: Autodesk.Revit.DB.Structure.MultiplanarOption
source: html/37cc5a15-0771-41dd-4456-6820c7cef725.htm
---
# Autodesk.Revit.DB.Structure.MultiplanarOption.IncludeOnlyPlanarCurves

Include only curves which lie in the Rebar's primary plane.